LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
 lcd_data(FLAG_COMMAND, HX8357_SET_PAGE_ADDRESS); // Row addr set
 #define rowstart 0
 lcd_data(FLAG_PARAM, (y0+rowstart) >> 8);
 lcd_data(FLAG_PARAM, y0+rowstart);     // YSTART
 lcd_data(FLAG_PARAM, (y1+rowstart) >> 8);
 lcd_data(FLAG_PARAM, y1+rowstart);     // YEND

}


void screen_poweroff(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  // TODO low power the screen and touchscreen

}

/**
  *
  *
  */
void EXTI15_10_IRQHandler(void) {
  // then it's the touch screen that interrupted
  // read the touch screen position data
  unsigned char buffer[32];
  HAL_I2C_Master_Receive(&hi2c, MSG2133_I2C_ADDR, buffer, 8, 1024);  // no timeout

  /*
  // light on upon touch
  UI_led_power(1);
  */

  if (buffer[0] == 0x52) {
    switch(buffer[1]) {
      case 0xFF:
#ifdef NANOS_DEVKIT
        // release is when no finger remains
        __asm("cpsid i");
        // don't perform release if an event is already ongoing or if already released
        if (G_io_seproxyhal_events & SEPROXYHAL_EVENT_BUTTON || G_io_button.pressed == 0) {
          __asm("cpsie i");
          break;
        }

        G_io_button.pressed = 0;
        G_io_button.duration_ms = 0;
        
        if (G_io_touch.ts_last_x >= BTN1_X && G_io_touch.ts_last_x <= BTN1_X+BTN1_W
         && G_io_touch.ts_last_y >= BTN1_Y && G_io_touch.ts_last_y <= BTN1_Y+BTN1_H) {
          G_io_button.pressed &= ~1;
        }

        if (G_io_touch.ts_last_x >= BTN2_X && G_io_touch.ts_last_x <= BTN2_X+BTN2_W
         && G_io_touch.ts_last_y >= BTN2_Y && G_io_touch.ts_last_y <= BTN2_Y+BTN2_H) {
          G_io_button.pressed &= ~2;
        }


        if (G_io_touch.ts_last_x2 >= BTN1_X && G_io_touch.ts_last_x2 <= BTN1_X+BTN1_W
         && G_io_touch.ts_last_y2 >= BTN1_Y && G_io_touch.ts_last_y2 <= BTN1_Y+BTN1_H) {
          G_io_button.pressed &= ~1;
        }

        if (G_io_touch.ts_last_x2 >= BTN2_X && G_io_touch.ts_last_x2 <= BTN2_X+BTN2_W
         && G_io_touch.ts_last_y2 >= BTN2_Y && G_io_touch.ts_last_y2 <= BTN2_Y+BTN2_H) {
          G_io_button.pressed &= ~2;
        }

        if (G_io_button.pressed==1) {
          // left button
          bagl_hal_draw_rect(0x700000, BTN1_X, BTN1_Y, BTN1_W, BTN1_H);
        }
        else {
          // left button
          bagl_hal_draw_rect(0xFF0000, BTN1_X, BTN1_Y, BTN1_W, BTN1_H);
        }
        if (G_io_button.pressed==2) {
          // right button
          bagl_hal_draw_rect(0x000070, BTN2_X, BTN2_Y, BTN2_W, BTN2_H);
        }
        else {
          // right button
          bagl_hal_draw_rect(0x0000FF, BTN2_X, BTN2_Y, BTN2_W, BTN2_H);
        }

        if (G_io_button.pressed == 3) {
          // both button
          bagl_hal_draw_rect(0x007000, BTN12_X, BTN12_Y, BTN12_W, BTN12_H);
        }
        else {
          // both button
          bagl_hal_draw_rect(0x00FF00, BTN12_X, BTN12_Y, BTN12_W, BTN12_H);
        }
        
        // at worst we released a touch
        G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BUTTON;
        __asm("cpsie i");
#else // NANOS_DEVKIT
        // releasing !!
        // only one release event to lower the cpu load
        if (G_io_touch.ts_last_x >= 0 && G_io_touch.ts_last_y >= 0) {
          __asm("cpsid i");
          G_io_seproxyhal_events |= SEPROXYHAL_EVENT_RELEASE;
          __asm("cpsie i");
        }
#endif // NANOS_DEVKIT
        break;
      default: {
        uint16_t x1, y1;
        x1 = ((buffer[1] & 0xF0) << 4) | buffer[2];
        y1 = ((buffer[1] & 0x0F) << 8) | buffer[3];
        
        //#ifdef YL035_2_FINGERS
        int16_t x2, y2;
        x2 = ((buffer[4] & 0xF0) << 4) | buffer[5];
        if (x2 & 0x800) { // sign extent
          x2 |= 0xF000;
        }
        y2 = ((buffer[4] & 0x0F) << 8) | buffer[6];
        if (y2 & 0x800) { // sign extent
          y2 |= 0xF000;
        }
        //x2 = x2 *15 / 64;//480/2048;
        //y2 = y2 * 5 / 32;//320/2048;
        //#endif // YL035_2_FINGERS

        G_io_touch.ts_last_2 = 0;
        if (x2 || y2) {
          x2 += x1;
          y2 += y1;

          // a second finger is available
          G_io_touch.ts_last_2 = 1;
        }


        // adjust the second finger with the offset of the first
        x1 = x1 *15 / 64;//480/2048;
        y1 = y1 * 5 / 32;//320/2048;

        x2 = x2 *15 / 64;//480/2048;
        y2 = y2 * 5 / 32;//320/2048;
 
        // reverse the y coord
#ifdef HAVE_PT035HV_ROTATION_0
        G_io_touch.ts_last_x = SCREEN_WIDTH-y1;
        G_io_touch.ts_last_y = x1;
        if (G_io_touch.ts_last_2) {
          G_io_touch.ts_last_x2 = SCREEN_WIDTH-y2;
          G_io_touch.ts_last_y2 = x2;
        }
#endif // HAVE_PT035HV_ROTATION_0
#ifdef HAVE_PT035HV_ROTATION_180
        G_io_touch.ts_last_x = y1;
        G_io_touch.ts_last_y = SCREEN_HEIGHT-x1;
        if (G_io_touch.ts_last_2) {
          G_io_touch.ts_last_x2 = y2;
          G_io_touch.ts_last_y2 = SCREEN_HEIGHT-x2;
        }
#endif // HAVE_PT035HV_ROTATION_180

#ifdef NANOS_DEVKIT
        // compute button mask
        __asm("cpsid i");
        unsigned old_mask = G_io_button.pressed;
        G_io_button.pressed = 0;
        G_io_button.duration_ms = 0;
        if (G_io_touch.ts_last_x >= BTN1_X && G_io_touch.ts_last_x <= BTN1_X+BTN1_W
         && G_io_touch.ts_last_y >= BTN1_Y && G_io_touch.ts_last_y <= BTN1_Y+BTN1_H) {
          G_io_button.pressed |= 1;
        }

        if (G_io_touch.ts_last_x >= BTN2_X && G_io_touch.ts_last_x <= BTN2_X+BTN2_W
         && G_io_touch.ts_last_y >= BTN2_Y && G_io_touch.ts_last_y <= BTN2_Y+BTN2_H) {
          G_io_button.pressed |= 2;
        }

        if (G_io_touch.ts_last_x >= BTN12_X && G_io_touch.ts_last_x <= BTN12_X+BTN12_W
         && G_io_touch.ts_last_y >= BTN12_Y && G_io_touch.ts_last_y <= BTN12_Y+BTN12_H) {
          G_io_button.pressed |= 3;
        }

        /* seems not to work
        if (G_io_touch.ts_last_x2 >= BTN1_X && G_io_touch.ts_last_x2 <= BTN1_X+BTN1_W
         && G_io_touch.ts_last_y2 >= BTN1_Y && G_io_touch.ts_last_y2 <= BTN1_Y+BTN1_H) {
          G_io_button.pressed |= 1;
        }

        if (G_io_touch.ts_last_x2 >= BTN2_X && G_io_touch.ts_last_x2 <= BTN2_X+BTN2_W
         && G_io_touch.ts_last_y2 >= BTN2_Y && G_io_touch.ts_last_y2 <= BTN2_Y+BTN2_H) {
          G_io_button.pressed |= 2;
        }
        */

        if (G_io_button.pressed) {
          if (G_io_button.pressed==1) {
            // left button
            bagl_hal_draw_rect(0x700000, BTN1_X, BTN1_Y, BTN1_W, BTN1_H);
          }
          else {
            // left button
            bagl_hal_draw_rect(0xFF0000, BTN1_X, BTN1_Y, BTN1_W, BTN1_H);
          }
          if (G_io_button.pressed==2) {
            // right button
            bagl_hal_draw_rect(0x000070, BTN2_X, BTN2_Y, BTN2_W, BTN2_H);
          }
          else {
            // right button
            bagl_hal_draw_rect(0x0000FF, BTN2_X, BTN2_Y, BTN2_W, BTN2_H);
          }

          if (G_io_button.pressed == 3) {
            // both button
            bagl_hal_draw_rect(0x007000, BTN12_X, BTN12_Y, BTN12_W, BTN12_H);
          }
          else {
            // both button
            bagl_hal_draw_rect(0x00FF00, BTN12_X, BTN12_Y, BTN12_W, BTN12_H);
          }
        }
        if (old_mask == 0) {
          G_io_seproxyhal_events |= SEPROXYHAL_EVENT_BUTTON;
        }
        __asm("cpsie i");
#else // NANOS_DEVKIT
        __asm("cpsid i");
        G_io_seproxyhal_events |= SEPROXYHAL_EVENT_TOUCH;
        __asm("cpsie i");
#endif // NANOS_DEVKIT
      }
    }
  }    
  __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_11);
}

// manually pump the touch events to avoid problems of the USART/I2C conflicts
void screen_update_touch_event(void) {

