LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/PT035HV_screen.c
#ifndef NANOS_DEVKIT
  if ((G_io_seproxyhal_events & (SEPROXYHAL_EVENT_TOUCH|SEPROXYHAL_EVENT_RELEASE)) == 0 
    && G_io_touch.ts_last_2) {
    G_io_touch.ts_last_2 = 0;
    G_io_touch.ts_last_x = G_io_touch.ts_last_x2;
    G_io_touch.ts_last_y = G_io_touch.ts_last_y2;
    G_io_seproxyhal_events |= SEPROXYHAL_EVENT_TOUCH;
    return;
  }
#endif // NANOS_DEVKIT

  if (__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_11)) {
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_11);
    EXTI15_10_IRQHandler();
  }
}

unsigned int current_x;
unsigned int newline_requested;
void screen_init(unsigned char reinit)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  G_io_touch.ts_last_2 = 0;
  G_io_touch.ts_last_x = -1;
  G_io_touch.ts_last_y = -1;

  current_x = 0;
  newline_requested = 0;
  memset(((char*)screen_charbuffer),' ',sizeof(screen_charbuffer));

  /* PC10 TS_CE */
  GPIO_InitStruct.Pin = GPIO_PIN_10;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /* PC11 TS_IRQ */
  GPIO_InitStruct.Pin = GPIO_PIN_11;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /**I2C1 GPIO Configuration    
  PB8     ------> I2C1_SCL
  PB9     ------> I2C1_SDA 
  */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* Peripheral clock enable */
  __I2C1_CLK_ENABLE();

  memset(&hi2c, 0, sizeof(hi2c));

  hi2c.Instance = I2C1;
  hi2c.Init.Timing = 0x10909CEC; // 100khz @ 80mhz
  hi2c.Init.Timing = 0x00702991; // 400khz @ 80mhz
  hi2c.Init.OwnAddress1 = 0;
  hi2c.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
  hi2c.Init.OwnAddress2 = 0;
  hi2c.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
  hi2c.Init.NoStretchMode = I2C_NOSTRETCH_DISABLED;
  HAL_I2C_Init(&hi2c);
  HAL_I2CEx_AnalogFilter_Config(&hi2c, I2C_ANALOGFILTER_ENABLED);

  // reset Touch screen
  TS_CE(0);

  if (!reinit) {
    // reset the display and clear it
    // setup touchscreen
    /* GPIO Ports Clock Enable */
    __GPIOB_CLK_ENABLE();
    __GPIOC_CLK_ENABLE();

    /* Peripheral clock enable */
    __SPI2_CLK_ENABLE();

    /**SPI2 GPIO Configuration    
    PB13     ------> SPI1_SCK
    PB15     ------> SPI1_MOSI 
    */
    GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* PB14 DISP_CS */
    GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    DISP_NCS(1);

    /* PC1 DISP_RESET (NRST) */
    GPIO_InitStruct.Pin = GPIO_PIN_1;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    DISP_NRST(0);

    //spi2_change_clock(16);
	
  SPI2->CR1 &= ~SPI_CR1_SPE;  
  hspi.Instance = SPI2;
  hspi.Init.Mode = SPI_MODE_MASTER;
  hspi.Init.Direction = SPI_DIRECTION_2LINES;
  hspi.Init.DataSize = SPI_DATASIZE_9BIT;
  hspi.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi.Init.NSS = SPI_NSS_SOFT;
  // OK // hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;

#ifdef LOW_SPEED_SCREEN
  hspi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
#endif // LOW_SPEED_SCREEN

  hspi.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi.Init.TIMode = SPI_TIMODE_DISABLED;
  hspi.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
  hspi.Init.CRCPolynomial = 10;
  hspi.Init.CRCLength = SPI_CRC_LENGTH_DATASIZE;
  hspi.Init.NSSPMode = SPI_NSS_PULSE_ENABLED;
  HAL_SPI_Init(&hspi);
  /* Enable SPI peripheral */
  SPI2->CR1 |=  SPI_CR1_SPE; 

    // reset the screen
    DISP_NRST(1);  
    /* Enable the interrupt service thread/routine for INT after 50ms */
    HAL_Delay(60);


    // first, force a hardware reset

    // assert delay before starting requests
    // 1000 = 6ms @ msirange 5
    // 166 = 1ms @ msirange 5
    // 333 = 1ms @ msirange 6 @4mhz
    // 20000 = 120ms @ msirange 5
    //for (volatile int i = 0; i < 1000; i++);

    DISP_NCS(0);
    lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_EXIT_SLEEP_MODE); //Sleep Out
    HAL_Delay(200);

    lcd_data(FLAG_COMMAND, HX8357_ENABLE_EXTENSION_COMMAND);
    lcd_data(FLAG_PARAM, 0xFF);
    lcd_data(FLAG_PARAM, 0x83);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x57);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_POWER_CONTROL);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0x12);
    lcd_data(FLAG_PARAM, 0xC3);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x44);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_DISPLAY_MODE);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x40);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x2A);
    lcd_data(FLAG_PARAM, 0x2A);
    lcd_data(FLAG_PARAM, 0x20);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x91);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_VCOM_VOLTAGE);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x38);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_INTERNAL_OSCILLATOR);
    lcd_data(FLAG_PARAM, 0x68);
    lcd_data(FLAG_COMMAND, 0xE3); //Unknown Command
    lcd_data(FLAG_PARAM, 0x2F);
    lcd_data(FLAG_PARAM, 0x1F);
    lcd_data(FLAG_COMMAND, HX8357_SET_BGP); //Set BGP
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x67);
    lcd_data(FLAG_COMMAND, HX8357_SET_PANEL_DRIVING);
    lcd_data(FLAG_PARAM, 0x70);
    lcd_data(FLAG_PARAM, 0x70);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x3C);
    lcd_data(FLAG_PARAM, 0xC8);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x08);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, 0xC2); // Set Gate EQ
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x08);
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x04);
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_PANEL_CHARACTERISTIC);
  #ifdef HAVE_PT035HV_ROTATION_0  
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x09); // proto screen direction
  #endif
  #ifdef HAVE_PT035HV_ROTATION_180
    lcd_data(FLAG_PARAM|FLAG_FLUSH, 0x05); // final screen direction (usb reversed)
  #endif 
    HAL_Delay(10);
    lcd_data(FLAG_COMMAND, HX8357_SET_GAMMA_CURVE);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x03);
    lcd_data(FLAG_PARAM, 0x05);
    lcd_data(FLAG_PARAM, 0x0E);
    lcd_data(FLAG_PARAM, 0x22);
    lcd_data(FLAG_PARAM, 0x32);
    lcd_data(FLAG_PARAM, 0x3B);
    lcd_data(FLAG_PARAM, 0x5C);
    lcd_data(FLAG_PARAM, 0x54);
    lcd_data(FLAG_PARAM, 0x4C);
    lcd_data(FLAG_PARAM, 0x41);
    lcd_data(FLAG_PARAM, 0x3D);
    lcd_data(FLAG_PARAM, 0x37);
    lcd_data(FLAG_PARAM, 0x31);
    lcd_data(FLAG_PARAM, 0x21);
    lcd_data(FLAG_PARAM, 0x01);
    lcd_data(FLAG_PARAM, 0x02);
    lcd_data(FLAG_PARAM, 0x03);
    lcd_data(FLAG_PARAM, 0x05);
    lcd_data(FLAG_PARAM, 0x0E);
    lcd_data(FLAG_PARAM, 0x22);
    lcd_data(FLAG_PARAM, 0x32);
    lcd_data(FLAG_PARAM, 0x3B);
    lcd_data(FLAG_PARAM, 0x5C);
    lcd_data(FLAG_PARAM, 0x54);
    lcd_data(FLAG_PARAM, 0x4C);
    lcd_data(FLAG_PARAM, 0x41);
    lcd_data(FLAG_PARAM, 0x3D);
    lcd_data(FLAG_PARAM, 0x37);
    lcd_data(FLAG_PARAM, 0x31);
    lcd_data(FLAG_PARAM, 0x21);
    lcd_data(FLAG_PARAM, 0x00);
    lcd_data(FLAG_PARAM, 0x01);
    HAL_Delay(10);
    
    lcd_data(FLAG_COMMAND, HX8357_SET_PIXEL_FORMAT); //COLMOD RGB565
    lcd_data(FLAG_PARAM, 0x55);
    
    lcd_data(FLAG_COMMAND, HX8357_SET_ADDRESS_MODE);
    lcd_data(FLAG_PARAM, 0x00);
    /*
    lcd_data(FLAG_COMMAND, HX8357_SET_TEAR_ON); //TE ON
    lcd_data(FLAG_PARAM, 0x00);
    */

    lcd_data(FLAG_COMMAND, HX8357_SET_INTERNAL_OSCILLATOR);
    //lcd_data(FLAG_PARAM, 0x66); // 60Hz
    lcd_data(FLAG_PARAM, 0x99); // 75Hz
    //lcd_data(FLAG_PARAM, 0xCC); // 90Hz
    lcd_data(FLAG_PARAM, 0x01); // OSC_EN

    // until screen_on is called
    lcd_data(FLAG_COMMAND, HX8357_ALLOFF);
    //

    lcd_data(FLAG_COMMAND|FLAG_FLUSH, HX8357_SET_DISPLAY_ON); //Display On
    HAL_Delay(10);

